Revit 2024 API
BuiltInFailures.ForeignFileFailures.ForeignLink Property
 This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ForeignLink { get; }
Visual Basic
Public Shared ReadOnly Property ForeignLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ForeignLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ForeignFileFailures Class
Autodesk.Revit.DB Namespace